Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# accounts-settings.account
source: Account
es_419: Cuenta
fr_fr: Compte
zh_cn: 账户

# accounts-settings.server
source: Server
es_419: Servidor
fr_fr: Serveur
zh_cn: 服务器

# accounts-settings.clone-using
source: Clone Using
es_419: Clonar usando
fr_fr: Cloner avec
zh_cn: 克隆方式

# accounts-settings.clone-description
source: New repositories will be cloned from %@ using %@.
es_419: Los repositorios nuevos se clonarán desde %@ usando %@.
fr_fr: Les nouveaux dépôts seront clonés depuis %@ en utilisant %@.
zh_cn: 新仓库将使用 %2$@ 从 %1$@ 克隆。

# accounts-settings.ssh-key
source: SSH Key
es_419: Clave SSH
fr_fr: Clé SSH
zh_cn: SSH 密钥

# accounts-settings.ssh-key-none
source: None
es_419: Ninguna
fr_fr: Aucune
zh_cn: 无

# accounts-settings.ssh-key-create-new
source: Create New...
es_419: Crear nueva...
fr_fr: Créer nouveau...
zh_cn: 创建新项目...

# accounts-settings.ssh-key-choose
source: Choose...
es_419: Elegir...
fr_fr: Choisir...
zh_cn: 选择…

# accounts-settings.delete-confirmation
source: Are you sure you want to delete the account "%@"?
es_419: ¿Estás seguro de que quieres eliminar la cuenta \"%@\"?
fr_fr: Voulez-vous vraiment supprimer le compte « %@ » ?
zh_cn: 确定要删除账户\"%@\"吗?

# accounts-settings.cancel
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# accounts-settings.delete-message
source: Deleting this account will remove it from CodeEdit.
es_419: Eliminar esta cuenta la quitará de CodeEdit.
fr_fr: La suppression de ce compte le retirera de CodeEdit.
zh_cn: 删除此账户将从 CodeEdit 中移除该账户。

# settings-page.general
source: General
fr_fr: Général
zh_cn: 通用

# settings-page.accounts
source: Accounts
es_419: Cuentas
fr_fr: Comptes
zh_cn: 账户

# settings-page.behaviors
source: Behaviors
es_419: Comportamientos
fr_fr: Comportements
zh_cn: 行为

# settings-page.themes
source: Themes
es_419: Temas
fr_fr: Thèmes
zh_cn: 主题

# settings-page.text-editing
source: Text Editing
es_419: Edición de texto
fr_fr: Édition de texte
zh_cn: 文本编辑

# settings-page.search
source: Search
es_419: Búsqueda
fr_fr: Recherche
zh_cn: 搜索

# settings-page.key-bindings
source: Key Bindings
es_419: Atajos de Teclado
fr_fr: Raccourcis clavier
zh_cn: 按键绑定

# settings-page.source-control
source: Source Control
es_419: Control de versiones
fr_fr: Contrôle de version
zh_cn: 版本控制

# settings-page.components
source: Components
es_419: Componentes
fr_fr: Composants
zh_cn: 组件

# settings-page.locations
source: Locations
es_419: Ubicaciones
fr_fr: Emplacements
zh_cn: 位置

# settings-page.advanced
source: Advanced
es_419: Avanzado
fr_fr: Avancé
zh_cn: 高级

# settings-page.developer
source: Developer
es_419: Desarrollador
fr_fr: Développeur
zh_cn: 开发者

# tab-bar.close-tab
source: Close Tab
es_419: Cerrar pestaña
fr_fr: Fermer l'onglet
zh_cn: 关闭标签页

# tab-bar.close-other-tabs
source: Close Other Tabs
es_419: Cerrar otras pestañas
fr_fr: Fermer les autres onglets
zh_cn: 关闭其他标签页

# tab-bar.close-tabs-to-right
source: Close Tabs to the Right
es_419: Cerrar pestañas a la derecha
fr_fr: Fermer les onglets à droite
zh_cn: 关闭右侧标签页

# tab-bar.close-all
source: Close All
es_419: Cerrar todo
fr_fr: Tout fermer
zh_cn: 全部关闭

# tab-bar.keep-open
source: Keep Open
es_419: Mantener abierta
fr_fr: Garder ouvert
zh_cn: 保持打开

# tab-bar.copy-path
source: Copy Path
es_419: Copiar ruta
fr_fr: Copier le chemin
zh_cn: 复制路径

# tab-bar.copy-relative-path
source: Copy Relative Path
es_419: Copiar ruta relativa
fr_fr: Copier le chemin relatif
zh_cn: 复制相对路径

# tab-bar.show-in-finder
source: Show in Finder
es_419: Mostrar en Finder
fr_fr: Afficher dans le Finder
zh_cn: 在 Finder 中显示

# tab-bar.reveal-in-navigator
source: Reveal in Project Navigator
es_419: Mostrar en el navegador de proyectos
fr_fr: Révéler dans le navigateur de projet
zh_cn: 在项目导航器中显示

# tab-bar.open-in-new-window
source: Open in New Window
es_419: Abrir en ventana nueva
fr_fr: Ouvrir dans une nouvelle fenêtre
zh_cn: 在新窗口中打开

# tab-bar.split-up
source: Split Up
es_419: Dividir arriba
fr_fr: Fractionner vers le haut
zh_cn: 向上拆分

# tab-bar.split-down
source: Split Down
es_419: Dividir abajo
fr_fr: Fractionner en bas
zh_cn: 向下拆分

# tab-bar.split-left
source: Split Left
es_419: Dividir a la izquierda
fr_fr: Fractionner à gauche
zh_cn: 向左拆分

# tab-bar.split-right
source: Split Right
es_419: Dividir a la derecha
fr_fr: Fractionner à droite
zh_cn: 向右拆分

# workspace.discard-all-changes-title
source: Do you want to discard all uncommitted, local changes?
es_419: ¿Quieres descartar todos los cambios locales sin confirmar?
fr_fr: Voulez-vous abandonner toutes les modifications locales non validées ?
zh_cn: 要丢弃所有未提交的本地更改吗?

# workspace.discard-all-changes-message
source: This action cannot be undone.
es_419: Esta acción no se puede deshacer.
fr_fr: Cette action est irréversible.
zh_cn: 此操作无法撤销。

# workspace.discard-button
source: Discard
es_419: Descartar
fr_fr: Abandonner
zh_cn: 丢弃

# workspace.cannot-stage-changes
source: Cannot Stage Changes
es_419: No se pueden preparar los cambios
fr_fr: Impossible d'indexer les modifications
zh_cn: 无法暂存更改

# workspace.no-uncommitted-changes
source: There are no uncommitted changes in the local repository for this project.
es_419: No hay cambios sin confirmar en el repositorio local para este proyecto.
fr_fr: Le dépôt local ne contient aucune modification non validée pour ce projet.
zh_cn: 此项目的本地仓库没有未提交的更改。

# workspace.cannot-unstage-changes
source: Cannot Unstage Changes
es_419: No se Pueden Quitar los Cambios del Stage
fr_fr: Impossible de désindexer les modifications
zh_cn: 无法取消暂存更改

# workspace.no-uncommitted-changes-unstage
source: There are no uncommitted changes in the local repository for this project.
es_419: No hay cambios sin confirmar en el repositorio local para este proyecto.
fr_fr: Le dépôt local ne contient aucune modification non validée pour ce projet.
zh_cn: 此项目的本地仓库没有未提交的更改。

# workspace.cannot-stash-changes
source: Cannot Stash Changes
es_419: No se pueden guardar los cambios en stash
fr_fr: Impossible de remiser les modifications
zh_cn: 无法贮藏更改

# workspace.no-uncommitted-changes-stash
source: There are no uncommitted changes in the local repository for this project.
es_419: No hay cambios sin confirmar en el repositorio local para este proyecto.
fr_fr: Le dépôt local ne contient aucune modification non validée pour ce projet.
zh_cn: 此项目的本地仓库没有未提交的更改。

# workspace.cannot-discard-changes
source: Cannot Discard Changes
es_419: No se pueden descartar los cambios
fr_fr: Impossible d'abandonner les modifications
zh_cn: 无法丢弃更改

# workspace.no-uncommitted-changes-discard
source: There are no uncommitted changes in the local repository for this project.
es_419: No hay cambios sin confirmar en el repositorio local para este proyecto.
fr_fr: Le dépôt local ne contient aucune modification non validée pour ce projet.
zh_cn: 此项目的本地仓库没有未提交的更改。

# accounts-signin.server
source: Server
es_419: Servidor
fr_fr: Serveur
zh_cn: 服务器

# accounts-signin.username
source: Username
es_419: Nombre de usuario
fr_fr: Nom d'utilisateur
zh_cn: 用户名

# accounts-signin.personal-access-token
source: Personal Access Token
es_419: Token de Acceso Personal
fr_fr: Jeton d'accès personnel
zh_cn: 个人访问令牌

# accounts-signin.sign-in-title
source: Sign in to %@
es_419: Iniciar sesión en %@
fr_fr: Se connecter à %@
zh_cn: 登录到 %@

# accounts-signin.token-scopes-message
source: %@ personal access tokens must have these scopes set:
es_419: Los tokens de acceso personal de %@ deben tener estos alcances configurados:
fr_fr: Les jetons d'accès personnels %@ doivent avoir ces portées définies :
zh_cn: %@ 个人访问令牌必须设置以下范围：

# accounts-signin.create-password-link
source: Create a Password on %@
es_419: Crear una contraseña en %@
fr_fr: Créer un mot de passe sur %@
zh_cn: 在 %@ 上创建密码

# accounts-signin.create-token-link
source: Create a Token on %@
es_419: Crear un token en %@
fr_fr: Créer un token sur %@
zh_cn: 在 %@ 上创建令牌

# accounts-signin.cancel-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# accounts-signin.sign-in-button
source: Sign In
es_419: Iniciar sesión
fr_fr: Se connecter
zh_cn: 登录

# accounts-signin.unable-to-add-account
source: Unable to add account "%@"
es_419: No se pudo agregar la cuenta \"%@\"
fr_fr: Impossible d'ajouter le compte \"%@\"
zh_cn: 无法添加账户\"%@\"

# accounts-signin.duplicate-account-error
source: Account with the same username and provider already exists!
es_419: ¡Ya existe una cuenta con el mismo nombre de usuario y proveedor!
fr_fr: Un compte avec le même nom d'utilisateur et fournisseur existe déjà !
zh_cn: 相同用户名和提供商的账户已存在！

# accounts-signin.authentication-failed
source: Authentication Failed
es_419: Autenticación fallida
fr_fr: Échec de l'authentification
zh_cn: 身份验证失败

# accounts-signin.api-access-forbidden
source: API Access Forbidden
es_419: Acceso a la API Prohibido
fr_fr: Accès à l'API interdit
zh_cn: API 访问被禁止

# accounts-signin.unknown-error
source: Unknown Error
es_419: Error desconocido
fr_fr: Erreur inconnue
zh_cn: 未知错误

# zip-error.unreadable-archive
source: Unreadable archive.
es_419: Archivo comprimido ilegible.
fr_fr: Archive illisible.
zh_cn: 无法读取归档文件。

# zip-error.unwritable-archive
source: Unwritable archive.
es_419: Archivo no escribible.
fr_fr: Archive non inscriptible.
zh_cn: 归档文件不可写。

# zip-error.invalid-entry-path
source: Invalid entry path.
es_419: Ruta de entrada inválida.
fr_fr: Chemin d'entrée invalide.
zh_cn: 条目路径无效。

# zip-error.invalid-compression-method
source: Invalid compression method.
es_419: Método de compresión inválido.
fr_fr: Méthode de compression invalide.
zh_cn: 压缩方法无效。

# zip-error.invalid-checksum
source: Invalid checksum.
es_419: Suma de verificación inválida.
fr_fr: Somme de contrôle invalide.
zh_cn: 校验和无效。

# zip-error.operation-cancelled
source: Operation cancelled.
es_419: Operación cancelada.
fr_fr: Opération annulée.
zh_cn: 操作已取消。

# zip-error.invalid-buffer-size
source: Invalid buffer size.
es_419: Tamaño de búfer inválido.
fr_fr: Taille de tampon invalide.
zh_cn: 缓冲区大小无效。

# zip-error.invalid-entry-size
source: Invalid entry size.
es_419: Tamaño de entrada inválido.
fr_fr: Taille d'entrée invalide.
zh_cn: 条目大小无效。

# zip-error.invalid-file-detected
source: Invalid file detected.
es_419: Archivo inválido detectado.
fr_fr: Fichier invalide détecté.
zh_cn: 检测到无效文件。

# zip-error.uncontained-symlink
source: Uncontained symlink detected.
es_419: Enlace simbólico no contenido detectado.
fr_fr: Lien symbolique non confiné détecté.
zh_cn: 检测到未包含的符号链接。

# zip-error.invalid-local-header-data-offset
source: Invalid local header data offset.
es_419: Desplazamiento de datos del encabezado local inválido.
fr_fr: Décalage de données d'en-tête local invalide.
zh_cn: 本地头数据偏移量无效。

# zip-error.invalid-local-header-size
source: Invalid local header size.
es_419: Tamaño de encabezado local inválido.
fr_fr: Taille d'en-tête local invalide.
zh_cn: 本地头部大小无效。

# zip-error.invalid-central-directory-offset
source: Invalid central directory offset.
es_419: Desplazamiento de directorio central inválido.
fr_fr: Décalage du répertoire central invalide.
zh_cn: 中心目录偏移量无效。

# zip-error.invalid-central-directory-size
source: Invalid central directory size.
es_419: Tamaño de directorio central inválido.
fr_fr: Taille du répertoire central invalide.
zh_cn: 中央目录大小无效。

# zip-error.invalid-central-directory-entry-count
source: Invalid central directory entry count.
es_419: Recuento de entradas del directorio central inválido.
fr_fr: Nombre d'entrées du répertoire central invalide.
zh_cn: 中央目录条目计数无效。

# zip-error.missing-end-of-central-directory-record
source: Missing end of central directory record.
es_419: Falta el registro de fin de directorio central.
fr_fr: Fin de l'enregistrement du répertoire central manquante.
zh_cn: 缺少中央目录结束记录。

# source-control-search.general
source: General
fr_fr: Général
zh_cn: 通用

# source-control-search.enable-source-control
source: Enable source control
es_419: Habilitar control de versiones
fr_fr: Activer le contrôle de version
zh_cn: 启用版本控制

# source-control-search.refresh-local-status
source: Refresh local status automatically
es_419: Actualizar estado local automáticamente
fr_fr: Actualiser l'état local automatiquement
zh_cn: 自动刷新本地状态

# source-control-search.fetch-refresh-server-status
source: Fetch and refresh server status automatically
es_419: Hacer fetch y actualizar estado del servidor automáticamente
fr_fr: Récupérer et actualiser l'état du serveur automatiquement
zh_cn: 自动获取并刷新服务器状态

# source-control-search.add-remove-files
source: Add and remove files automatically
es_419: Agregar y quitar archivos automáticamente
fr_fr: Ajouter et retirer les fichiers automatiquement
zh_cn: 自动添加和移除文件

# source-control-search.select-files-to-commit
source: Select files to commit automatically
es_419: Seleccionar archivos para commit automáticamente
fr_fr: Sélectionner automatiquement les fichiers à committer
zh_cn: 自动选择要提交的文件

# source-control-search.show-source-control-changes
source: Show source control changes
es_419: Mostrar cambios de control de versiones
fr_fr: Afficher les modifications du contrôle de version
zh_cn: 显示版本控制更改

# source-control-search.include-upstream-changes
source: Include upstream changes
es_419: Incluir cambios remotos
fr_fr: Inclure les modifications en amont
zh_cn: 包含上游更改

# source-control-search.comparison-view
source: Comparison view
es_419: Vista de comparación
fr_fr: Affichage de comparaison
zh_cn: 对比视图

# source-control-search.source-control-navigator
source: Source control navigator
es_419: Navegador de control de versiones
fr_fr: Navigateur de contrôle de version
zh_cn: 版本控制导航器

# source-control-search.default-branch-name
source: Default branch name
es_419: Nombre de rama predeterminado
fr_fr: Nom de branche par défaut
zh_cn: 默认分支名称

# source-control-search.author-name
source: Author Name
es_419: Nombre del autor
fr_fr: Nom de l'auteur
zh_cn: 作者名称

# source-control-search.author-email
source: Author Email
es_419: Correo del autor
fr_fr: E-mail de l'auteur
zh_cn: 作者邮箱

# source-control-search.prefer-rebase-when-pulling
source: Prefer to rebase when pulling
es_419: Preferir rebase al hacer pull
fr_fr: Privilégier le rebase lors du pull
zh_cn: 拉取时优先使用 rebase

# source-control-search.show-merge-commits-per-file-log
source: Show merge commits in per-file log
es_419: Mostrar commits de fusión en el registro por archivo
fr_fr: Afficher les commits de fusion dans le journal par fichier
zh_cn: 在单个文件日志中显示合并提交

# github-package.git-permission
source: This package requires git to install. Allow CodeEdit to run git commands?
es_419: Este paquete requiere git para instalarse. ¿Permitir que CodeEdit ejecute comandos de git?
fr_fr: Ce paquet nécessite git pour s'installer. Autoriser CodeEdit à exécuter des commandes git ?
zh_cn: 此包需要 git 才能安装。是否允许 CodeEdit 运行 git 命令？

# github-package.initialize-directory
source: Initialize Directory Structure
es_419: Inicializar estructura de directorios
fr_fr: Initialiser la structure de répertoires
zh_cn: 初始化目录结构

# github-package.download-binary
source: Download Binary Executable
es_419: Descargar ejecutable binario
fr_fr: Télécharger l'exécutable binaire
zh_cn: 下载二进制可执行文件

# github-package.downloading-url
source: Downloading %@
es_419: Descargando %@
fr_fr: Téléchargement de %@
zh_cn: 正在下载 %@

# github-package.http-error
source: HTTP error
es_419: Error de HTTP
fr_fr: Erreur HTTP
zh_cn: HTTP 错误

# github-package.could-not-download
source: Could not download package
es_419: No se pudo descargar el paquete
fr_fr: Impossible de télécharger le paquet
zh_cn: 无法下载包

# github-package.decompress-binary
source: Decompress Binary Executable
es_419: Descomprimir ejecutable binario
fr_fr: Décompresser l'exécutable binaire
zh_cn: 解压二进制可执行文件

# github-package.decompressing-file
source: Decompressing %@
es_419: Descomprimiendo %@
fr_fr: Décompression de %@
zh_cn: 正在解压 %@

# github-package.decompressed-to-path
source: Decompressed to '%@'
es_419: Descomprimido en '%@'
fr_fr: Décompressé vers '%@'
zh_cn: 已解压至 '%@'

# github-package.decompressing-tar
source: Decompressing %@ using `tar`
es_419: Descomprimiendo %@ usando `tar`
fr_fr: Décompression de %@ avec `tar`
zh_cn: 使用 `tar` 解压 %@

# github-package.decompressing-gunzip
source: Decompressing %@ using `gunzip`
es_419: Descomprimiendo %@ usando `gunzip`
fr_fr: Décompression de %@ avec `gunzip`
zh_cn: 使用 `gunzip` 解压 %@

# github-package.clone-with-git
source: Clone with Git
es_419: Clonar con Git
fr_fr: Cloner avec Git
zh_cn: 使用 Git 克隆

# github-package.clone-command-message
source: This step will run the following command to clone the package from source control: `%@`
es_419: Este paso ejecutará el siguiente comando para clonar el paquete desde el control de versiones: `%@`
fr_fr: Cette étape exécutera la commande suivante pour cloner le paquet depuis le contrôle de version : `%@`
zh_cn: 此步骤将运行以下命令从版本控制克隆包： `%@`

# github-package.install-from-source
source: Install From Source
es_419: Instalar desde código fuente
fr_fr: Installer depuis les sources
zh_cn: 从源代码安装

# github-package.install-command-message
source: This step will run the following to finish installing: `%@`
es_419: Este paso ejecutará lo siguiente para finalizar la instalación: `%@`
fr_fr: Cette étape exécutera la commande suivante pour terminer l'installation : `%@`
zh_cn: 此步骤将运行以下命令完成安装： `%@`

# github-package.source-build-failed
source: Source build failed.
es_419: No se pudo compilar desde la fuente.
fr_fr: Échec de la compilation depuis les sources.
zh_cn: 源码构建失败。

# source-control-navigator.apply-stashed-changes-title
source: Do you want to apply stashed changes?
es_419: ¿Quieres aplicar los cambios del stash?
fr_fr: Voulez-vous appliquer la remise ?
zh_cn: 要应用贮藏的更改吗?

# source-control-navigator.uncommitted-changes-title
source: The local repository has uncommitted changes.
es_419: El repositorio local tiene cambios sin confirmar.
fr_fr: Le dépôt local contient des modifications non validées.
zh_cn: 本地仓库有未提交的更改。

# source-control-navigator.apply-button
source: Apply
es_419: Aplicar
fr_fr: Appliquer
zh_cn: 应用

# source-control-navigator.apply-and-delete-button
source: Apply and Delete
es_419: Aplicar y eliminar
fr_fr: Appliquer et supprimer
zh_cn: 应用并删除

# source-control-navigator.cancel-button
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# source-control-navigator.okay-button
source: Okay
es_419: Aceptar
fr_fr: OK
zh_cn: 好

# source-control-navigator.apply-stashed-changes-message
source: Applying the stashed changes will restore modifications to files in your local repository.
es_419: Aplicar los cambios del stash restaurará las modificaciones a los archivos en tu repositorio local.
fr_fr: L'application des modifications en remise les restaurera dans les fichiers de votre dépôt local.
zh_cn: 应用贮藏的更改将恢复本地仓库中文件的修改。

# source-control-navigator.uncommitted-changes-message
source: Try committing or discarding the changes.
es_419: Intenta hacer commit o descartar los cambios.
fr_fr: Essayez de committer ou d'abandonner les modifications.
zh_cn: 请尝试提交或丢弃更改。

# source-control-navigator.delete-button
source: Delete
es_419: Eliminar
fr_fr: Supprimer
zh_cn: 删除

# source-control-navigator.failed-to-delete
source: Failed to delete
es_419: No se pudo eliminar
fr_fr: Échec de la suppression
zh_cn: 删除失败

# source-control-navigator.delete-branch-message
source: The branch will be removed from the repository. You can't undo this action.
es_419: La rama se eliminará del repositorio. No puedes deshacer esta acción.
fr_fr: La branche sera supprimée du dépôt. Cette action est irréversible.
zh_cn: 分支将从仓库中移除。此操作无法撤销。

# source-control-navigator.delete-stash-button
source: Delete
es_419: Eliminar
fr_fr: Supprimer
zh_cn: 删除

# source-control-navigator.failed-to-delete-stash
source: Failed to delete
es_419: No se pudo eliminar
fr_fr: Échec de la suppression
zh_cn: 删除失败

# source-control-navigator.delete-stash-message
source: The stash will be removed from the repository. You can't undo this action.
es_419: El stash se eliminará del repositorio. No puedes deshacer esta acción.
fr_fr: La remise sera supprimée du dépôt. Cette action est irréversible.
zh_cn: 该贮藏将从仓库中移除。此操作无法撤销。

# source-control-navigator.delete-remote-button
source: Delete
es_419: Eliminar
fr_fr: Supprimer
zh_cn: 删除

# source-control-navigator.failed-to-delete-remote
source: Failed to delete
es_419: No se pudo eliminar
fr_fr: Échec de la suppression
zh_cn: 删除失败

# source-control-navigator.delete-remote-message
source: The remote will be removed from the repository. You can't undo this action.
es_419: El remoto se eliminará del repositorio. No puedes deshacer esta acción.
fr_fr: Le distant sera supprimé du dépôt. Cette action est irréversible.
zh_cn: 远程将从仓库中移除。此操作无法撤销。

# invisibles-settings.show-spaces
source: Show Spaces
es_419: Mostrar espacios
fr_fr: Afficher les espaces
zh_cn: 显示空格

# invisibles-settings.default-space
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.space-character
source: Character used to render spaces
es_419: Carácter usado para mostrar espacios
fr_fr: Caractère utilisé pour afficher les espaces
zh_cn: 用于渲染空格的字符

# invisibles-settings.show-tabs
source: Show Tabs
es_419: Mostrar tabulaciones
fr_fr: Afficher les tabulations
zh_cn: 显示制表符

# invisibles-settings.default-tab
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.tab-character
source: Character used to render tabs
es_419: Carácter usado para representar tabulaciones
fr_fr: Caractère utilisé pour représenter les tabulations
zh_cn: 用于渲染制表符的字符

# invisibles-settings.show-line-endings
source: Show Line Endings
es_419: Mostrar finales de línea
fr_fr: Afficher les fins de ligne
zh_cn: 显示行尾符

# invisibles-settings.default-linefeed
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.linefeed-character
source: Character used to render line feeds (\\n)
es_419: Carácter usado para representar los saltos de línea (\n)
fr_fr: Caractère utilisé pour afficher les sauts de ligne (\n)
zh_cn: 用于渲染换行符 (\n) 的字符

# invisibles-settings.default-carriage-return
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.carriage-return-character
source: Character used to render carriage returns (Microsoft-style line endings)
es_419: Carácter usado para representar retornos de carro (finales de línea estilo Microsoft)
fr_fr: Caractère utilisé pour afficher les retours chariot (fins de ligne style Microsoft)
zh_cn: 用于渲染回车符的字符（Microsoft 样式的行尾符）

# invisibles-settings.default-paragraph-separator
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.paragraph-separator-character
source: Character used to render paragraph separators
es_419: Carácter usado para representar separadores de párrafo
fr_fr: Caractère utilisé pour représenter les séparateurs de paragraphe
zh_cn: 用于渲染段落分隔符的字符

# invisibles-settings.default-line-separator
source: Default: %@
es_419: Predeterminado: %@
fr_fr: Par défaut : %@
zh_cn: 默认：%@

# invisibles-settings.line-separator-character
source: Character used to render line separators
es_419: Carácter usado para mostrar separadores de línea
fr_fr: Caractère utilisé pour afficher les séparateurs de ligne
zh_cn: 用于渲染行分隔符的字符

# invisibles-settings.title
source: Invisible Characters
es_419: Caracteres invisibles
fr_fr: Caractères invisibles
zh_cn: 不可见字符

# invisibles-settings.description
source: Toggle whitespace symbols CodeEdit will render with replacement characters.
es_419: Alternar símbolos de espacios en blanco que CodeEdit renderizará con caracteres de reemplazo.
fr_fr: Choisir les symboles d'espacement que CodeEdit affichera avec des caractères de remplacement.
zh_cn: 切换空白符号，CodeEdit 将用替换字符渲染。

# invisibles-settings.done-button
source: Done
es_419: Listo
fr_fr: Terminé
zh_cn: 完成
